In [308]:
import pandas as pd
import numpy as np

# LABEL ENCODER

In [309]:
df=pd.read_csv("C:\\Users\\HARSHITA\\Downloads\\Data_sets\\toyota - toyota.csv")
df.head(3)

  model  year  price transmission  mileage fuelType  tax   mpg  engineSize
0  GT86  2016  16000       Manual    24089   Petrol  265  36.2         2.0
1  GT86  2017  15995       Manual    18615   Petrol  145  36.2         2.0
2  GT86  2015  13998       Manual    27469   Petrol  265  36.2         2.0

In [310]:
df.isnull().sum()

model           0
year            0
price           0
transmission    0
mileage         0
fuelType        0
tax             0
mpg             0
engineSize      0
dtype: int64

In [311]:
x=df.drop(columns='price')
y=df['price']

In [312]:
from sklearn.preprocessing import LabelEncoder

In [313]:
lb=LabelEncoder()

In [314]:
x['model']=lb.fit_transform(x['model'])
x['transmission']=lb.fit_transform(x['transmission'])
x['fuelType']=lb.fit_transform(x['fuelType'])

In [315]:
x.head(3)

   model  year  transmission  mileage  fuelType  tax   mpg  engineSize
0      6  2016             1    24089         3  265  36.2         2.0
1      6  2017             1    18615         3  145  36.2         2.0
2      6  2015             1    27469         3  265  36.2         2.0

In [316]:
from sklearn.model_selection import train_test_split

In [317]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=42)

In [318]:
from sklearn.preprocessing import StandardScaler

In [319]:
sc=StandardScaler()

In [320]:
x_train_sc=sc.fit_transform(x_train)

In [321]:
x_train_new=pd.DataFrame(x_train_sc,columns=x_train.columns)

In [322]:
x_train_new

,model,year,transmission,mileage,fuelType,tax,mpg,engineSize
0,0.559875,-1.714977,-1.034397,1.177959,-1.988188,2.237004,-1.298162,1.674691
1,1.279924,1.032316,0.488936,-0.564646,0.773991,0.680715,-0.945313,0.073624
2,0.559875,-0.341330,-1.034397,0.200492,0.773991,1.425027,-1.217688,1.217244
3,-0.448194,1.032316,0.488936,-0.671125,0.773991,0.680715,-1.483872,-0.612547
4,1.279924,1.032316,0.488936,-0.908110,0.773991,0.680715,-0.945313,0.073624
...,...,...,...,...,...,...,...,...
5385,-0.880223,0.116552,0.488936,-0.570352,0.773991,0.680715,0.354657,-1.069995
5386,-0.880223,1.032316,0.488936,-1.128344,0.773991,0.680715,-0.412945,-1.069995
5387,-0.880223,-0.341330,0.488936,-0.011785,0.773991,-1.281563,0.360847,-1.069995
5388,-0.880223,1.032316,0.488936,-1.074529,0.773991,0.680715,-0.412945,-1.069995
5389,1.279924,-0.799213,0.488936,-0.201028,0.773991,-0.875574,-0.505800,-0.383823

In [323]:
np.round(x_train_new.describe(),2)

,model,year,transmission,mileage,fuelType,tax,mpg,engineSize
count,5390.00,5390.00,5390.00,5390.00,5390.00,5390.00,5390.00,5390.00
mean,0.00,-0.00,0.00,0.00,0.00,-0.00,0.00,-0.00
std,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00
min,-1.17,-8.58,-1.03,-1.19,-1.99,-1.28,-3.74,-3.36
25%,-0.88,-0.34,-1.03,-0.70,-1.07,-1.28,-0.48,-1.07
50%,-0.45,0.12,0.49,-0.23,0.77,0.55,-0.02,0.07
75%,1.28,0.57,0.49,0.43,0.77,0.68,0.36,0.76
max,1.28,1.49,3.54,7.94,0.77,6.36,10.64,6.94

# ORDINAL ENCODING

In [324]:
df=pd.read_csv("C:\\Users\\HARSHITA\\Downloads\\Data_sets\\toyota - toyota.csv")
df.head(3)

  model  year  price transmission  mileage fuelType  tax   mpg  engineSize
0  GT86  2016  16000       Manual    24089   Petrol  265  36.2         2.0
1  GT86  2017  15995       Manual    18615   Petrol  145  36.2         2.0
2  GT86  2015  13998       Manual    27469   Petrol  265  36.2         2.0

In [325]:
df.isnull().sum()

model           0
year            0
price           0
transmission    0
mileage         0
fuelType        0
tax             0
mpg             0
engineSize      0
dtype: int64

In [326]:
categorical_col=df.select_dtypes(include=['object'])
categorical_col.head(3)

  model transmission fuelType
0  GT86       Manual   Petrol
1  GT86       Manual   Petrol
2  GT86       Manual   Petrol

In [327]:
numerical_col=df.select_dtypes(exclude=['object'])
numerical_col.head(3)

   year  price  mileage  tax   mpg  engineSize
0  2016  16000    24089  265  36.2         2.0
1  2017  15995    18615  145  36.2         2.0
2  2015  13998    27469  265  36.2         2.0

In [328]:
df=df.drop(columns=['year','mileage','tax','mpg','engineSize','price'])

In [329]:
from sklearn.preprocessing import OrdinalEncoder

In [330]:
df['model'].unique()

array(['GT86', 'Corolla', 'RAV4', 'Yaris', 'Auris', 'Aygo', 'C-HR',
       'Prius', 'Avensis', 'Verso', 'Hilux', 'PROACE VERSO',
       'Land Cruiser', 'Supra', 'Camry', 'Verso-S', 'IQ', 'Urban Cruiser'],
      dtype=object)

In [331]:
df['transmission'].unique()

array(['Manual', 'Automatic', 'Semi-Auto', 'Other'], dtype=object)

In [332]:
df['fuelType'].unique()

array(['Petrol', 'Other', 'Hybrid', 'Diesel'], dtype=object)

In [333]:
df.head(2)

  model transmission fuelType
0  GT86       Manual   Petrol
1  GT86       Manual   Petrol

In [334]:
oe=OrdinalEncoder(categories=[['GT86', 'Corolla', 'RAV4', 'Yaris', 'Auris', 'Aygo', 'C-HR',
       'Prius', 'Avensis', 'Verso', 'Hilux', 'PROACE VERSO',
       'Land Cruiser', 'Supra', 'Camry', 'Verso-S', 'IQ', 'Urban Cruiser'],
       ['Manual', 'Automatic', 'Semi-Auto', 'Other'],
      ['Petrol', 'Other', 'Hybrid', 'Diesel'] ])

In [335]:
df_oe=oe.fit_transform(df)

In [336]:
df_new=pd.DataFrame(df_oe,columns=df.columns)

In [337]:
df_new

      model  transmission  fuelType
0       0.0           0.0       0.0
1       0.0           0.0       0.0
2       0.0           0.0       0.0
3       0.0           0.0       0.0
4       0.0           0.0       0.0
...     ...           ...       ...
6733   16.0           1.0       0.0
6734   17.0           0.0       0.0
6735   17.0           0.0       3.0
6736   17.0           0.0       0.0
6737   17.0           0.0       0.0

[6738 rows x 3 columns]

In [338]:
df_nnew=pd.concat([df_new,numerical_col],axis=1)
df_nnew

,model,transmission,fuelType,year,price,mileage,tax,mpg,engineSize
0,0.0,0.0,0.0,2016,16000,24089,265,36.2,2.0
1,0.0,0.0,0.0,2017,15995,18615,145,36.2,2.0
2,0.0,0.0,0.0,2015,13998,27469,265,36.2,2.0
3,0.0,0.0,0.0,2017,18998,14736,150,36.2,2.0
4,0.0,0.0,0.0,2017,17498,36284,145,36.2,2.0
...,...,...,...,...,...,...,...,...,...
6733,16.0,1.0,0.0,2011,5500,30000,20,58.9,1.0
6734,17.0,0.0,0.0,2011,4985,36154,125,50.4,1.3
6735,17.0,0.0,3.0,2012,4995,46000,125,57.6,1.4
6736,17.0,0.0,0.0,2011,3995,60700,125,50.4,1.3
6737,17.0,0.0,0.0,2011,4495,45128,125,50.4,1.3

In [339]:
from sklearn.preprocessing import MinMaxScaler

In [340]:
mn=MinMaxScaler()

In [341]:
df_nnew_mn=mn.fit_transform(df_nnew)

In [342]:
df_new_new=pd.DataFrame(df_nnew_mn,columns=df_nnew.columns)

In [343]:
df_new_new

,model,transmission,fuelType,year,price,mileage,tax,mpg,engineSize
0,0.000000,0.000000,0.0,0.818182,0.256150,0.138100,0.469027,0.143842,0.444444
1,0.000000,0.000000,0.0,0.863636,0.256066,0.106716,0.256637,0.143842,0.444444
2,0.000000,0.000000,0.0,0.772727,0.222301,0.157479,0.469027,0.143842,0.444444
3,0.000000,0.000000,0.0,0.863636,0.306839,0.084476,0.265487,0.143842,0.444444
4,0.000000,0.000000,0.0,0.863636,0.281478,0.208019,0.256637,0.143842,0.444444
...,...,...,...,...,...,...,...,...,...
6733,0.941176,0.333333,0.0,0.590909,0.078620,0.171990,0.035398,0.241602,0.222222
6734,1.000000,0.000000,0.0,0.590909,0.069913,0.207273,0.221239,0.204996,0.288889
6735,1.000000,0.000000,1.0,0.636364,0.070082,0.263724,0.221239,0.236003,0.311111
6736,1.000000,0.000000,0.0,0.590909,0.053174,0.348005,0.221239,0.204996,0.288889
6737,1.000000,0.000000,0.0,0.590909,0.061628,0.258725,0.221239,0.204996,0.288889

In [344]:
np.round(df_new_new.describe(),2)

,model,transmission,fuelType,year,price,mileage,tax,mpg,engineSize
count,6738.00,6738.00,6738.00,6738.00,6738.00,6738.00,6738.00,6738.00,6738.00
mean,0.25,0.16,0.28,0.85,0.20,0.13,0.17,0.26,0.33
std,0.12,0.19,0.36,0.10,0.11,0.11,0.13,0.07,0.10
min,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.00,0.00
25%,0.18,0.00,0.00,0.82,0.13,0.05,0.00,0.23,0.22
50%,0.24,0.00,0.00,0.86,0.17,0.11,0.24,0.26,0.33
75%,0.29,0.33,0.67,0.91,0.24,0.18,0.26,0.29,0.40
max,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00

# ONE SHOT ENCODING

In [357]:
df=pd.read_csv("C:\\Users\\HARSHITA\\Downloads\\Data_sets\\Churn_Modelling - Churn_Modelling.csv")
df.head(3)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1

In [358]:
numerical_col=df.select_dtypes(exclude=['object'])
numerical_col.head(2)

,RowNumber,CustomerId,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,619,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,608,41,1,83807.86,1,0,1,112542.58,0

In [359]:
categorical_col=df.select_dtypes(include=['object'])
categorical_col.head(2)

    Surname Geography  Gender
0  Hargrave    France  Female
1      Hill     Spain  Female

In [360]:
from sklearn.preprocessing import OneHotEncoder

In [361]:
ohe=OneHotEncoder(drop='first',sparse_output=False,dtype=np.int32)

In [362]:
ohe.fit_transform(df[['Surname','Geography','Gender']])

array([[0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 1, 0],
       [0, 0, 0, ..., 0, 0, 0],
       ...,
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 1, 0, 1],
       [0, 0, 0, ..., 0, 0, 0]], shape=(10000, 2934), dtype=int32)

In [363]:
#get_dummies
a=pd.get_dummies(df,columns=['Surname','Geography','Gender'],drop_first=True)

In [353]:
a=a.astype(int)

In [354]:
a

,RowNumber,CustomerId,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,...,Surname_Zotova,Surname_Zox,Surname_Zubarev,Surname_Zubareva,Surname_Zuev,Surname_Zuyev,Surname_Zuyeva,Geography_Germany,Geography_Spain,Gender_Male
0,1,15634602,619,42,2,0,1,1,1,101348,...,0,0,0,0,0,0,0,0,0,0
1,2,15647311,608,41,1,83807,1,0,1,112542,...,0,0,0,0,0,0,0,0,1,0
2,3,15619304,502,42,8,159660,3,1,0,113931,...,0,0,0,0,0,0,0,0,0,0
3,4,15701354,699,39,1,0,2,0,0,93826,...,0,0,0,0,0,0,0,0,0,0
4,5,15737888,850,43,2,125510,1,1,1,79084,...,0,0,0,0,0,0,0,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,15606229,771,39,5,0,2,1,0,96270,...,0,0,0,0,0,0,0,0,0,1
9996,9997,15569892,516,35,10,57369,1,1,1,101699,...,0,0,0,0,0,0,0,0,0,1
9997,9998,15584532,709,36,7,0,1,0,1,42085,...,0,0,0,0,0,0,0,0,0,0
9998,9999,15682355,772,42,3,75075,2,1,0,92888,...,0,0,0,0,0,0,0,1,0,1
9999,10000,15628319,792,28,4,130142,1,1,0,38190,...,0,0,0,0,0,0,0,0,0,0

In [372]:
x=a.drop(columns='Balance')
y=a['Balance']

In [373]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=42)

In [374]:
sc=StandardScaler()

In [375]:
a_sc=sc.fit_transform(a)

In [376]:
a_new=pd.DataFrame(a_sc,columns=a.columns)

In [377]:
np.round(a_new.describe(),2)

,RowNumber,CustomerId,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,...,Surname_Zotova,Surname_Zox,Surname_Zubarev,Surname_Zubareva,Surname_Zuev,Surname_Zuyev,Surname_Zuyeva,Geography_Germany,Geography_Spain,Gender_Male
count,10000.00,10000.00,10000.00,10000.00,10000.00,10000.00,10000.00,10000.00,10000.00,10000.00,...,10000.00,10000.00,10000.00,10000.00,10000.00,10000.00,10000.00,10000.00,10000.00,10000.00
mean,0.00,0.00,-0.00,0.00,-0.00,-0.00,0.00,0.00,-0.00,-0.00,...,-0.00,-0.00,-0.00,0.00,-0.00,0.00,0.00,0.00,-0.00,0.00
std,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,...,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00,1.00
min,-1.73,-1.74,-3.11,-1.99,-1.73,-1.23,-0.91,-1.55,-1.03,-1.74,...,-0.01,-0.01,-0.02,-0.01,-0.01,-0.01,-0.01,-0.58,-0.57,-1.10
25%,-0.87,-0.87,-0.69,-0.66,-0.70,-1.23,-0.91,-1.55,-1.03,-0.85,...,-0.01,-0.01,-0.02,-0.01,-0.01,-0.01,-0.01,-0.58,-0.57,-1.10
50%,0.00,-0.00,0.02,-0.18,-0.00,0.33,-0.91,0.65,0.97,0.00,...,-0.01,-0.01,-0.02,-0.01,-0.01,-0.01,-0.01,-0.58,-0.57,0.91
75%,0.87,0.87,0.70,0.48,0.69,0.82,0.81,0.65,0.97,0.86,...,-0.01,-0.01,-0.02,-0.01,-0.01,-0.01,-0.01,1.73,-0.57,0.91
max,1.73,1.73,2.06,5.06,1.72,2.80,4.25,0.65,0.97,1.74,...,99.99,99.99,57.73,99.99,99.99,70.70,70.70,1.73,1.74,0.91

In [378]:
a_new.head(6)

,RowNumber,CustomerId,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,...,Surname_Zotova,Surname_Zox,Surname_Zubarev,Surname_Zubareva,Surname_Zuev,Surname_Zuyev,Surname_Zuyeva,Geography_Germany,Geography_Spain,Gender_Male
0,-1.731878,-0.783213,-0.326221,0.293517,-1.041760,-1.225848,-0.911583,0.646092,0.970243,0.021886,...,-0.010001,-0.010001,-0.017323,-0.010001,-0.010001,-0.014144,-0.014144,-0.578736,-0.573809,-1.095988
1,-1.731531,-0.606534,-0.440036,0.198164,-1.387538,0.117350,-0.911583,-1.547768,0.970243,0.216534,...,-0.010001,-0.010001,-0.017323,-0.010001,-0.010001,-0.014144,-0.014144,-0.578736,1.742740,-1.095988
2,-1.731185,-0.995885,-1.536794,0.293517,1.032908,1.333053,2.527057,0.646092,-1.030670,0.240687,...,-0.010001,-0.010001,-0.017323,-0.010001,-0.010001,-0.014144,-0.014144,-0.578736,-0.573809,-1.095988
3,-1.730838,0.144767,0.501521,0.007457,-1.387538,-1.225848,0.807737,-1.547768,-1.030670,-0.108918,...,-0.010001,-0.010001,-0.017323,-0.010001,-0.010001,-0.014144,-0.014144,-0.578736,-0.573809,-1.095988
4,-1.730492,0.652659,2.063884,0.388871,-1.041760,0.785728,-0.911583,0.646092,0.970243,-0.365276,...,-0.010001,-0.010001,-0.017323,-0.010001,-0.010001,-0.014144,-0.014144,-0.578736,1.742740,-1.095988
5,-1.730146,-1.625530,-0.057205,0.484225,1.032908,0.597329,0.807737,0.646092,-1.030670,0.863650,...,-0.010001,-0.010001,-0.017323,-0.010001,-0.010001,-0.014144,-0.014144,-0.578736,1.742740,0.912419